# GetOptions Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalService..::..GetOptions Method
ExternalService Class See Also
---
A copy of the options the service was registered with.
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ExternalServiceOptions GetOptions()
```

Visual Basic
---
```text
Public Function GetOptions As ExternalServiceOptions
```

Visual C++
---
```text
public:
ExternalServiceOptions^ GetOptions()
```

# ### Return Value
An instance of the options class.
# Remarks
The returned instance is mutable, but any changes made there cannot be assigned back to the service.
# See Also
ExternalService Class
Autodesk.Revit.DB.ExternalService Namespace